import { useNavigate } from "react-router-dom";
import { images } from "../../../config";
import AdminLayout from "../../components/shared/Layout/AdminLayout";
import ServiceCard2 from "../../components/shared/ServiceCard2";


const AgentDatas = [
  {
    title: "মাষ্টার এজেন্ট লিষ্টঃ",
    link:'/admins/agent',
    des: `এজেন্ট দের সাথে লেনদেন এর আগে 1Tenর নিয়ম গুলো জেনে নিন!!
    **প্রতারনার হাত থেকে বাচতে সবার আগে ভিজিট করুন 1Ten সাইটঃ 1Ten.COM  **হোয়াটসঅ্যাপ ব্যাতিত অন্য কোন এপ এর মাধ্যমে যোগাযোগ বা লেনদেন করা যাবে না এবং করলে তা গ্রহনযোগ্য হবে না। **এজেন্ট পাসোয়ার্ড পরিবর্তন করে দিলে - আপনি একাউন্টে ঢুকে আবার পাসোয়ার্ড পরিবর্তন করে নিবেন। এজেন্ট যাতে কোন ভাবেই আপনার পাসোয়ার্ড না জানে। আপনার পাসোয়ার্ড আপনি কাউকেই দিবেন না - সে যেই হউক না কেন। **সকাল ৯ঃ৪৫ এর আগে এবং রাত ৯ঃ৪৫ এর পরে কোন ইউজার যদি এজেন্ট কে টাকা পাঠায় – অই টাকার দায়ভার 1Ten নিবে না। **প্রতিবার এজেন্ট এর কাছ থেকে পয়েন্ট নেবার আগে – এজেন্ট এর কাছে লেনদেন এর তথ্য জেনে নিতে হবে। যেহেতু এজেন্ট এক এক সময় এক ভাবে লেনদেন করে সেহেতু এই তথ্য জানা জরুরী। **এজেন্ট এর বিরুদ্ধে কোন অভিযোগ থাকলে এজেন্ট এর নামের শেষে অভিযোগ বাটন এ ক্লিক করলে যে হোয়াটসঅ্যাপ নাম্বার আসবে - তাকে অভিযোগ করতে হবে।`,
    img: images.superAgentPoster,
  },
  {
    title: "সুপার এজেন্ট লিষ্টঃ",
    link:'/admins/superAgent',
    des: `এজেন্ট দের সাথে লেনদেন এর আগে 1Tenর নিয়ম গুলো জেনে নিন!!
    **প্রতারনার হাত থেকে বাচতে সবার আগে ভিজিট করুন 1Ten সাইটঃ 1Ten.COM  **হোয়াটসঅ্যাপ ব্যাতিত অন্য কোন এপ এর মাধ্যমে যোগাযোগ বা লেনদেন করা যাবে না এবং করলে তা গ্রহনযোগ্য হবে না।`,
    img: images.superAgentPoster,
  },
  {
    title: "সাব এডমিন লিষ্টঃ",
    link:'/admins/subAdmin',
    des: `এজেন্ট দের সাথে লেনদেন এর আগে 1Tenর নিয়ম গুলো জেনে নিন!!
    **প্রতারনার হাত থেকে বাচতে সবার আগে ভিজিট করুন 1Ten সাইটঃ 1Ten.COM  **হোয়াটসঅ্যাপ ব্যাতিত অন্য কোন এপ এর মাধ্যমে যোগাযোগ বা লেনদেন করা যাবে না এবং করলে তা গ্রহনযোগ্য হবে না।`,
    img: images.subAdminPoster,
  },
  {
    title: "এডমিন লিষ্টঃ",
    link:'/admins/admin',
    des: `এজেন্ট দের সাথে লেনদেন এর আগে 1Tenর নিয়ম গুলো জেনে নিন!!
    **প্রতারনার হাত থেকে বাচতে সবার আগে ভিজিট করুন 1Ten সাইটঃ 1Ten.COM  **হোয়াটসঅ্যাপ ব্যাতিত অন্য কোন এপ এর মাধ্যমে যোগাযোগ বা লেনদেন করা যাবে না এবং করলে তা গ্রহনযোগ্য হবে না।`,
    
    
  },
  {
    title: "এজেন্ট কয় প্রকারঃ",
    des: `অনলাইন সুপার এজেন্টঃ সুপার এজেন্ট রা, ইউজার একাউন্ট এবং মাষ্টার এজেন্ট একাউন্ট খুলে দিতে পারেন। কোন সুপার এজেন্ট এর নামে অভিযোগ থাকলে - অভিযোগ বাটন এ ক্লিক করে সরাসরি সাব এডমিন কে জানাতে হবে। 

    অনলাইন মাষ্টার এজেন্টঃ অনলাইন মাষ্টার এজেন্ট রা, শুধু ইউজার একাউন্ট একাউন্ট খুলে দিতে পারেন। কোন মাষ্টার এজেন্ট এর নামে অভিযোগ থাকলে - অভিযোগ বাটন এ ক্লিক করে সরাসরি সুপার এজেন্ট এর কাছে অভিযোগ করতে হবে। বিস্তারিত জানতে এই লিঙ্ক এ ক্লিক করুন। 
    
    লোকাল মাষ্টার এজেন্টঃ এই সব এজেন্ট সাধারনত – নিজের এলাকায় বা পরিচিত দের সাথে লেনদেন করে । যারা আগে বাজি ধরিয়ে দিত, তাদের কেই মুলত লোকাল এজেন্ট দেয়া হয়েছে। লোকাল এজেন্ট রা অনলাইনে আসে না এবং তারা তাদের পরিচয় গোপন রাখতে চায়। লোকাল এজেন্ট দের সাথে অনলাইনে কোন ভাবেই লেনদেন করবেন না, আর করে থাকলে তার দায়ভার পুরোটাই আপনার। -
    
    `,
    link:'/faq/howManyAgent',
    img:images.howManyAgent,
  },
  {
    title: "এজেন্ট লিস্টঃ",
    des: `একাউন্ট খুলতে নিম্বের অনলাইন এজেন্ট লিস্ট এ ক্লিক করুন। এজেন্ট লিষ্ট এর এজেন্ট দের সাথে ইউজার দের শুধু মাত্র হোয়াটসাপ এর মাধ্যমে যোগাযোগ করতে হবে। হোয়াটসাপ ছাড়া অন্য কোন মাধ্যমে যোগাযোগ করলে বা লেনদেন করলে তা গ্রহনযোগ্য হবে না। হোয়াটসাপ এ যোগাযোগ করতে হলে এজেন্ট লিস্টে হোয়াটসাপ আইকন উপরে ক্লিক করুন অথবা ফোন নাম্বার টি মোবাইলে সেভ করে তাকে হোয়াটসাপ এ মসেজ পাঠাতে পারবেন। হোয়াটসাপ এপ টি আপনার মোবাইলে আগে থেকেই থাকতে হবে। না থাকলে গুগুল প্লে থেকে ইন্সটল করে নিন।
    `,
    link:'/faq/workOfAgent',
    img:images.workOfAgent,
  },
];

const AllAgents = () => {
  const navigate = useNavigate();

  return (
    <AdminLayout>
      {/* part1 start */}
      <div className="border-b border-slate-300 w-full">
        <div className="p-5">
          <h1 className=" text-2xl lg:text-[30px] font-semibold hover:text-red-700">
            কাস্টমার সার্ভিস লিষ্ট
          </h1>
          <div className="my-5">
            <span className="border border-gray-800 px-3 py-1">Agent</span>
          </div>

          <div className="my-2 w-full">
            <img className="w-full" src={images.custServicePoster} alt="" />
          </div>

          <h2 className=" mt-4 lg:mt-10 lg:text-[25px] text-center font-semibold">
            1TEN CUSTOMER SERVICE LIST
          </h2>

          <div>
            <button
              onClick={() => {
                navigate("/admins/customerService");
              }}
              className="mt-8 text-sm bg-gray-100 hover:bg-gray-300 w-full py-2 border border-slate-400"
            >
              Read More...কাস্টমার সার্ভিস লিষ্ট
            </button>
          </div>
        </div>
      </div>
       {/* part1 end */}

       {/* part2 start */}

       <div className="p-5">
              <div className="grid lg:grid-cols-3  gap-4">
                {AgentDatas.map((item, i) => (
                  <ServiceCard2 item={item} key={i} />
                ))}
              </div>
            </div>
       {/* part2 end */}

      
    </AdminLayout>
  );
};

export default AllAgents;
